/*
HW_12_TEXT
1. Установить на компьютер Java JDK (если ещё не сделано).
        2. Установить на компьютер IJ (если ещё не сделано).
        3. Написать программу, которая выводит на экран фразу "Я изучаю программирование!".
        4. Написать программу, которая выводит на экран результат сложения чисел 10 и 20.
*/

public class hw_12 {
    public static void main(String[] args) {
        System.out.println("Я изучаю программирование!");
        System.out.println("10 + 20 = " + (10 + 20));
    }
}
