package hw_26;

/*
Задача 1

Давайте представим, что мы пишем программу для ветеринарной клиники.
Создайте класс Pet(Домашнее животное) Поля: тип (кот, собака, попугай и т.д.), имя, цвет, возраст
Реализуйте конструктор, toString() Реализуйте метод, который позволяет создать объект Pet используя Scanner

Задача 2
Используя написанные в задаче 1 классы и методы напишите программу,
которая позволяет ввести несколько домашних животных и формирует из них массив.
Выведите этот массив на экран.
 */

public class Main {

    public static void main(String[] args) {

        //Pet pet = Pet.createPetFromInput();
        //System.out.println("Вы записали животное: ");
        //System.out.println(pet);

    }
}